app/Controllers/AdminOpd/KelolaPegawaiOpd.php

SELECT *
FROM `opd`
WHERE `id_opd` = '3'
---
    public function create()
    {
        // Ambil `id_opd` langsung dari pengguna yang sedang login
        $adminOpdId = auth()->user()->id_opd;

        $opdModel = new OpdModel();
        $opd = $opdModel->where('id_opd', $adminOpdId)->findAll();