app/Controllers/Superadmin/Dashboard.php

SELECT *
FROM `jenis_inovasi`
SELECT COUNT(*) AS `numrows`
FROM `inovasi`
WHERE `kategori` = '36'
SELECT DATE_FORMAT(tanggal_kunjungan, '%m-%Y') as bulan_tahun, COUNT(*) as jumlah_kunjungan
FROM `kunjungan`
GROUP BY `bulan_tahun`
ORDER BY `bulan_tahun` ASC
---
    public function index()
    {
        // Memuat model yang diperlukan
        $kategoriModel = new JenisInovasiModel();
        $bentukModel = new BentukModel();
        $tahapanModel = new TahapanModel();
        $inovasiModel = new InovasiModel();  // Model untuk tabel inovasi (atau yang memiliki kategori)
        $kunjunganModel = new KunjunganModel();  // Model untuk tabel kunjungan

        // Mengambil semua jenis inovasi
        $jenisInovasi = $kategoriModel->findAll();

        // Mengambil jumlah inovasi berdasarkan id_jenis_inovasi
        $kategoriCounts = [];
        foreach ($jenisInovasi as $jenis) {
            $count = $inovasiModel->where('kategori', $jenis['id_jenis_inovasi'])->countAllResults();
            $kategoriCounts[] = [
                'nama_jenis' => $jenis['nama_jenis'],
                'count' => $count,
            ];
        }

        // Mengambil data kunjungan per bulan
        $kunjunganData = $kunjunganModel->select("DATE_FORMAT(tanggal_kunjungan, '%m-%Y') as bulan_tahun, COUNT(*) as jumlah_kunjungan")
            ->groupBy("bulan_tahun")
            ->orderBy("bulan_tahun", "ASC")
            ->findAll();

SELECT *
FROM `bentuk`
SELECT *
FROM `tahapan`
---
            'title' => 'Dashboard Inovasi',
            'log' => $this->logModel->getLogWithUser(),
            'kategoriOptions' => $kategoriModel->findAll(),  // Opsi kategori yang digunakan di form
            'bentukOptions' => $bentukModel->findAll(),
            'tahapanOptions' => $tahapanModel->findAll(),