app/Controllers/Superadmin/DesaController.php

SELECT *
FROM `kecamatan`
WHERE `kecamatan`.`id_kecamatan` = '1'
SELECT `desa`.`id_desa`, `desa`.`nama_desa`, `desa`.`id_kecamatan`, `kecamatan`.`nama_kecamatan`
FROM `desa`
JOIN `kecamatan` ON `kecamatan`.`id_kecamatan` = `desa`.`id_kecamatan`
WHERE `desa`.`id_kecamatan` = '1'
---
    public function index()
    {
        // Inisialisasi model
        $desaModel = new DesaModel();
        $kecamatanModel = new KecamatanModel();

        // Mengambil data desa dengan join ke tabel kecamatan
        $data['desa'] = $desaModel
        ->select('desa.id_desa, desa.nama_desa, desa.id_kecamatan, kecamatan.nama_kecamatan')
        ->join('kecamatan', 'kecamatan.id_kecamatan = desa.id_kecamatan')
        ->findAll();


        // Mengambil data kecamatan
        $data['kecamatan'] = $kecamatanModel->findAll();

INSERT INTO `log_aktivitas` (`id_user`, `tanggal_aktivitas`, `aksi`, `jenis_data`, `keterangan`) VALUES (24, '2024-12-03 23:45:52', 'hapus data', 'jenis inovasi', 'SuperAdmin dengan ID 24 menghapus data Desa ')
---
    public function delete($id)
    {
        $desaModel = new DesaModel();
        $logModel = new LogAktivitasModel();

        $desa = $desaModel->find($id);  // Temukan data sebelum dihapus
        $desaModel->delete($id);

        // Mendapatkan ID pengguna (SuperAdmin) yang sedang login
        $superAdminId = auth()->user()->id;

        // Menghapus data jenis inovasi berdasarkan ID
        if ($desaModel->delete($id)) {

            // Data untuk log aktivitas
            $logData = [
                'id_user'          => $superAdminId,
                'tanggal_aktivitas' => Time::now('Asia/Jakarta', 'en')->toDateTimeString(), // Format tanggal
                'aksi'             => 'hapus data', // Tindakan yang dilakukan
                'jenis_data'       => 'jenis inovasi', // Jenis data yang terlibat
                'keterangan'       => "SuperAdmin dengan ID {$superAdminId} menghapus data Desa ",
            ];

            // Simpan log aktivitas ke dalam database
            $logModel->save($logData);