app/Controllers/Superadmin/KecamatanController.php

SELECT *
FROM `kecamatan`
---
        public function index()
        {
            // Inisialisasi model
            $model = new KecamatanModel();

            // Mengambil semua data dari tabel jenis_inovasi
            $data['kecamatan'] = $model->findAll();