app/Controllers/Superadmin/KelolaDataInovasi.php

INSERT INTO `inovasi` (`judul`, `deskripsi`, `kategori`, `status`, `kecamatan`, `tanggal_pengajuan`, `id_user`, `id_opd`, `url_file`) VALUES ('Bupati Dendi Ramadhona Hadiri Peletakan Batu Pertama Pembangunan Masjid Ash Shihhah RSUD Pesawaran', 'kjkhuvgyvf ggb n mhbhbhbhbhbhhbhbgvfcfvh n jn njgycgvbn jnjnjyvt', '1', 'tertunda', 'WAY KHILAU', '2024-12-02 14:51:01', 33, '1', 'uploads/1733125861_119a82d6d72570200a11.pdf')
---
        //     $data['published_at'] = date('Y-m-d H:i:s');
        // }

        $this->inovasiModel->save($data);

INSERT INTO `log_aktivitas` (`id_user`, `tanggal_aktivitas`, `aksi`, `jenis_data`, `keterangan`) VALUES (33, '2024-12-02 14:51:01', 'tambah data', 'Inovasi', 'SuperAdmin dengan ID 33 menambahkan data Inovasi dengan ID 1')
---
            'jenis_data' => 'Inovasi',
            'keterangan' => "SuperAdmin dengan ID {$user} menambahkan data Inovasi dengan ID {$newInovasiId}",
        ];
        $this->LogAktivitasModel->save($logData);