app/Controllers/Superadmin/KelolaBerita.php

INSERT INTO `log_aktivitas` (`id_user`, `tanggal_aktivitas`, `aksi`, `jenis_data`, `keterangan`) VALUES (1, '2024-10-26 18:31:45', 'delete', 'Berita', 'SuperAdmin with ID 1 deleted Berita with ID 4')
---
public function delete($id){
    $superAdminId = auth()->user()->id;

    if ($this->beritaModel->delete($id)) {

        // Data log aktivitas untuk pencatatan
        $logData = [
            'id_user'          => $superAdminId,
            'tanggal_aktivitas' => Time::now('Asia/Jakarta', 'en')->toDateTimeString(), // Format tanggal
            'aksi'             => 'delete', // Tindakan yang dilakukan
            'jenis_data'       => 'Berita', // Jenis data yang terlibat
            'keterangan'       => "SuperAdmin with ID {$superAdminId} deleted Berita with ID {$id}",
        ];

        // Simpan log aktivitas
        $logModel = new LogAktivitasModel();
        $logModel->save($logData);