app/Controllers/Superadmin/KelolaOptionWeb.php

SELECT *
FROM `option_web`
---
    public function index()
    {
        $model = new OptionWebModel();

        // Mengambil semua data dari tabel option_web
        $options = $model->findAll();

UPDATE `option_web` SET `value` = 'logo.jpg'
WHERE `option_web`.`id_setting` IN ('27')
---
            'value' => $fileNameToSave
        ];

        if ($optionWebModel->update($id, $data)) {