app/Controllers/Superadmin/KelolaBentuk.php

    public function index()
    {
        // Inisialisasi model
        $model = new BentukModel();

        // Mengambil semua data dari tabel tahapan
        $data['bentuk'] = $model->findAll();
---
SELECT *
FROM `bentuk`