app/Controllers/Superadmin/KelolaGaleri.php

SELECT *
FROM `galeri`
---
    public function index()
    {
        $galeriModel = new GaleriModel();
        $data['galeris'] = $galeriModel->findAll();