app/Controllers/Superadmin/KelolaUser.php

    public function indexPegawai()
    {
        $userModel = new UserModel();
        $groupModel = new GroupModel();
        $opdModel = new OpdModel();

        // Ambil semua OPD dan buat array mapping ID ke nama OPD
        $allOpds = $opdModel->findAll();
        $opdNames = [];
        foreach ($allOpds as $opd) {
            $opdNames[$opd->id_opd] = $opd->nama_opd;
        }

        $pegawaiOPD = [];

        // Ambil semua pengguna yang aktif dengan filter `id_opd` tidak kosong
        $users = $userModel->where('active', 1)->where('id_opd !=', null)->findAll();
---
SELECT *
FROM `users`
WHERE `active` = 1
AND `id_opd` IS NOT NULL
AND `users`.`deleted_at` IS NULL