app/Views/layout/master_landing_page.php

SELECT *
FROM `jenis_inovasi`
---
use App\Models\JenisInovasiModel;

$jenisInovasiModel = new JenisInovasiModel();
$jenis_inovasi = $jenisInovasiModel->findAll();