app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Load model JenisInovasiModel untuk mendapatkan semua jenis inovasi
        $jenisInovasiModel = new JenisInovasiModel();
        $this->jenis_inovasi = $jenisInovasiModel->findAll();

        // Load model OptionWebModel untuk mendapatkan key Nama
        $optionWebModel = new OptionWebModel();
        $nama = $optionWebModel->where('key', 'Nama')->first();
---
SELECT *
FROM `jenis_inovasi`
SELECT *
FROM `option_web`
WHERE `key` = 'Nama'
 LIMIT 1