app/Controllers/LandingController.php

SELECT *
FROM `galeri`
---
    public function semuaFoto()
    {

        $galeriModel = new GaleriModel();

        $data = [
            'galeri' => $galeriModel->findAll(),
        ];