app/Controllers/LandingController.php

SELECT *
FROM `option_web`
WHERE `key` = 'Nama'
 LIMIT 1
---
    public function __construct()
    {
        $this->inovasiModel = new InovasiModel();
        $this->JenisInovasiModel = new JenisInovasiModel();

        // Ambil nama website saat konstruktor dijalankan
        $optionWebModel = new OptionWebModel();
        $nama = $optionWebModel->where('key', 'Nama')->first();

SELECT *
FROM `option_web`
WHERE `key` = 'Banner'
 LIMIT 1
SELECT *
FROM `option_web`
WHERE `key` = 'Banner2'
 LIMIT 1
SELECT *
FROM `option_web`
WHERE `key` = 'Banner3'
 LIMIT 1
SELECT *
FROM `galeri`
SELECT *
FROM `option_web`
WHERE `key` = 'Deskripsi'
 LIMIT 1
---
    public function index()
    {
        $beritaModel = new BeritaModel();
        $galeriModel = new GaleriModel();
        $optionWebModel = new OptionWebModel();
        $this->logKunjungan();

        $banner = $optionWebModel->where('key', 'Banner')->first();
        $banner2 = $optionWebModel->where('key', 'Banner2')->first();
        $banner3 = $optionWebModel->where('key', 'Banner3')->first();


        $data = [
            'title' => 'Beranda',
            'beritas' => $beritaModel->getPublishedNews(), // Menggunakan $beritaModel tanpa $this
            'galeri' => $galeriModel->findAll(),           // Menggunakan $galeriModel tanpa $this
            'banner' => $banner,
            'banner2' => $banner2,
            'banner3' => $banner3,
            'namaWebsite' => $this->namaWebsite, // Kirim nama website ke view

        ];

INSERT INTO `kunjungan` (`tanggal_kunjungan`, `ip_address`) VALUES ('2024-12-24 20:22:50', '::1')
---
    private function logKunjungan()
    {
        $kunjunganModel = new KunjunganModel();

        // Set zona waktu Indonesia (WIB)
        date_default_timezone_set('Asia/Jakarta');

        // Ambil waktu sekarang
        $currentTime = date('Y-m-d H:i:s');

        // Ambil IP address pengunjung
        $ipAddress = $this->request->getIPAddress();  // Mengambil alamat IP pengunjung

        // Simpan data kunjungan ke database
        $kunjunganModel->save([
            'tanggal_kunjungan' => $currentTime,
            'ip_address' => $ipAddress
        ]);

SELECT *
FROM `option_web`
WHERE `key` = 'Regulasi'
 LIMIT 1
---
    public function regulasi()
    {
        $optionWebModel = new OptionWebModel();

        // Mendapatkan data dari tabel option_web dengan key 'Deskripsi'
        $deskripsi = $optionWebModel->where('key', 'Regulasi')->first(); // Mengambil satu record