app/Controllers/SuperAdminController.php

    public function index()
    {
        // Inisialisasi model
        $model = new JenisInovasiModel();

        // Mengambil semua data dari tabel jenis_inovasi
        $data['jenis_inovasi'] = $model->findAll();
---
SELECT *
FROM `jenis_inovasi`