app/Models/BeritaModel.php

public function getPublishedNews($id = null)
{
    $query = $this->db->table('berita')
                      ->select('berita.*, users.username AS uploaded_by_username')
                      ->join('users', 'users.id = berita.posted_by', 'left')
                      ->where('berita.status', 'published');

    // Jika $id diberikan, tambahkan kondisi filter berdasarkan id_berita
    if ($id !== null) {
        $query->where('berita.id_berita', $id); // Sesuaikan nama kolom 'id_berita'
    }

    $result = $query->get()->getResultArray();
---
SELECT `berita`.*, `users`.`name` AS `uploaded_by_username`
FROM `berita`
LEFT JOIN `users` ON `users`.`id` = `berita`.`posted_by`
WHERE `berita`.`status` = 'published'
SELECT `berita`.*, `users`.`username` AS `uploaded_by_username`
FROM `berita`
LEFT JOIN `users` ON `users`.`id` = `berita`.`posted_by`
WHERE `berita`.`status` = 'published'
AND `berita`.`id_berita` = '3'