app/Models/BeritaModel.php

SELECT `berita`.*, `users`.`name` AS `uploaded_by_username`
FROM `berita`
LEFT JOIN `users` ON `users`.`id` = `berita`.`posted_by`
WHERE `berita`.`status` = 'published'
ORDER BY `berita`.`tanggal_post` DESC
---
    public function getPublishedNewsNew($slug = null)
    {
        $query = $this->db->table('berita')
                          ->select('berita.*, users.name AS uploaded_by_username')
                          ->join('users', 'users.id = berita.posted_by', 'left')
                          ->where('berita.status', 'published')
                          ->orderBy('berita.tanggal_post', 'DESC'); // Urutkan berdasarkan tanggal_post terbaru