app/Models/GroupModel.php

    public function getGroupsForUser(int $userId)
    {
        return $this->db->table('auth_groups_users') // Pastikan tabel ini benar
                    ->where('user_id', $userId)
                    ->get()
                    ->getResultArray();
---
SELECT *
FROM `auth_groups_users`
WHERE `user_id` = 1