app/Models/InovasiModel.php

    public function getJumlahInovasiPerKecamatan()
    {
        return $this->select('kecamatan, COUNT(*) as jumlahInovasi')
                    ->groupBy('kecamatan')
                    ->findAll();
---
SELECT `kecamatan`, COUNT(*) as jumlahInovasi
FROM `inovasi`
GROUP BY `kecamatan`