app/Models/OpdModel.php

SELECT `opd`.*
FROM `opd`
---
    public function getOpd($id = null)
    {
        if ($id != null) {
            // Menggunakan asObject() untuk memastikan pengembalian objek entitas
            return $this->asObject()->find($id);  // Mengembalikan objek entitas
        }
        return $this->asObject()->findAll();  // Mengembalikan semua OPD sebagai objek entitas

SELECT `opd`.*
FROM `opd`
WHERE `opd`.`id_opd` = '4'
---
    public function getAvailableOpd($usedOpdIds)
    {
        if (!empty($usedOpdIds)) {
            return $this->whereNotIn('id_opd', $usedOpdIds)->findAll();